In [1]:
# Ingest√£o de dados em banco de dados sqlite3 com pandas dataframe

In [7]:
import pandas as pd

In [2]:

dados = {'emp_name': [
    'Beverly Lang', 'Kameko French', 'Ursa George', 'Ferris Brown', 'Noel Meyer', 'Abel Kim', 'Raphael Hull', 'Jack Salazar', 'May Stout', 'Haviva Montoya'],
    'emp_mgr': [
    'Mike Palomino', 'Mike Palomino', 'Rich Hernandez', 'Dan Brodi', 'Kari Phelps', 'Rich Hernandez', 'Kari Phelps', 'Kari Phelps', 'Rich Hernandez', 'Mike Palomino'],
    'dealer_id': [2, 2, 3, 1, 1, 3, 1, 1, 3, 2],
    'sales': [
    16233, 16233, 15427, 19745, 19745, 12369, 8227, 9710, 9308, 9308]}

In [13]:
df = pd.DataFrame(dados)
df

         emp_name         emp_mgr  dealer_id  sales
0    Beverly Lang   Mike Palomino          2  16233
1   Kameko French   Mike Palomino          2  16233
2     Ursa George  Rich Hernandez          3  15427
3    Ferris Brown       Dan Brodi          1  19745
4      Noel Meyer     Kari Phelps          1  19745
5        Abel Kim  Rich Hernandez          3  12369
6    Raphael Hull     Kari Phelps          1   8227
7    Jack Salazar     Kari Phelps          1   9710
8       May Stout  Rich Hernandez          3   9308
9  Haviva Montoya   Mike Palomino          2   9308

### SqlLite3

In [3]:
import sqlite3

In [4]:
conn = sqlite3.connect('db/function.db')

#### Dataframe para banco de dados MySql

In [40]:
# Criando tabela TbWindow lendo do dataframe
nomeTabela = 'TbWindow'
resultado = df.to_sql(nomeTabela,conn, if_exists='fail', index=False)

ValueError: Table 'TbWindow' already exists.

In [58]:
# Lendo do banco de dados
query = 'SELECT * FROM TbWindow'
lendo = conn.execute(query)
lendo.fetchall()

[(0, 'Beverly Lang', 'Mike Palomino', 2, 16233),
 (1, 'Kameko French', 'Mike Palomino', 2, 16233),
 (2, 'Ursa George', 'Rich Hernandez', 3, 15427),
 (3, 'Ferris Brown', 'Dan Brodi', 1, 19745),
 (4, 'Noel Meyer', 'Kari Phelps', 1, 19745),
 (5, 'Abel Kim', 'Rich Hernandez', 3, 12369),
 (6, 'Raphael Hull', 'Kari Phelps', 1, 8227),
 (7, 'Jack Salazar', 'Kari Phelps', 1, 9710),
 (8, 'May Stout', 'Rich Hernandez', 3, 9308),
 (9, 'Haviva Montoya', 'Mike Palomino', 2, 9308)]

In [9]:
# Lendo do banco de dados como dataframe
query = 'SELECT * FROM TbWindow'
dfselect = pd.read_sql(query, conn)
dfselect

   index        emp_name         emp_mgr  dealer_id  sales
0      0    Beverly Lang   Mike Palomino          2  16233
1      1   Kameko French   Mike Palomino          2  16233
2      2     Ursa George  Rich Hernandez          3  15427
3      3    Ferris Brown       Dan Brodi          1  19745
4      4      Noel Meyer     Kari Phelps          1  19745
5      5        Abel Kim  Rich Hernandez          3  12369
6      6    Raphael Hull     Kari Phelps          1   8227
7      7    Jack Salazar     Kari Phelps          1   9710
8      8       May Stout  Rich Hernandez          3   9308
9      9  Haviva Montoya   Mike Palomino          2   9308